app/views/games/show.html.haml

SELECT "categories".* FROM "categories" INNER JOIN "divisions" ON "categories"."id" = "divisions"."category_id" WHERE "divisions"."game_id" = ?  [["game_id", 1]]
---
    %ul.nav.nav-tabs{:style => "border-bottom: none;"}
      /- @game.categories.each do |category|