app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 06 Sep 2013 05:25:35 UTC +00:00], ["name", "any%"], ["updated_at", Fri, 06 Sep 2013 05:25:35 UTC +00:00]]
---
  def create
    @game = Game.friendly.find(params[:game_id])
    @category = @game.categories.create(category_params)