app/controllers/divisions_controller.rb

  def index
    @divisions = Division.all
---
SELECT "divisions".* FROM "divisions"

  def create
    @division = Division.new(division_params)

    respond_to do |format|
      if @division.save
---
INSERT INTO "divisions" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 06 Sep 2013 05:27:44 UTC +00:00], ["updated_at", Fri, 06 Sep 2013 05:27:44 UTC +00:00]]

  def destroy
    @division.destroy
---
DELETE FROM "divisions" WHERE "divisions"."id" = ?  [["id", 980190962]]

    def set_division
      @division = Division.find(params[:id])
---
SELECT "divisions".* FROM "divisions" WHERE "divisions"."id" = ? LIMIT 1  [["id", "980190962"]]