app/controllers/games_controller.rb

  def show
    if params[:category_id].present?
      @category = Category.friendly.find(params[:category_id])
    else
      @category = @game.categories.first
---
SELECT "game_categories".* FROM "game_categories" WHERE "game_categories"."game_id" = ?  [["game_id", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "divisions" ON "categories"."id" = "divisions"."category_id" WHERE "divisions"."game_id" = ?  [["game_id", 1]]

  def create
    @game = Game.create(game_params)
---
INSERT INTO "games" ("cover", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)

    def set_game
      @game = Game.friendly.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "list"]]